; domain
(define (domain robotic-object-serving)

  (:requirements :strips :typing)

  (:types
    object   ; manipulable items (mug, bowl, etc.)
    location ; symbolic places the robot/objects can be at
  )

  (:predicates
    (robot-at ?l - location)          ; robot's current location
    (at ?o - object ?l - location)    ; object o is resting at location l
    (in ?o1 - object ?o2 - object)    ; object o1 is contained inside object o2
    (holding ?o - object)             ; gripper is currently holding o
    (gripper-empty)                   ; gripper holds nothing
    (positioned ?o - object)          ; o has been placed at a target location but not yet released
  )

  ; ---------------------------------------------------------------
  ; Move the robot between two symbolic locations
  ; ---------------------------------------------------------------
  (:action move
    :parameters (?from - location ?to - location)
    :precondition (and (robot-at ?from))
    :effect (and
              (not (robot-at ?from))
              (robot-at ?to))
  )

  ; ---------------------------------------------------------------
  ; Remove an object from inside a container it is nested in
  ; (e.g., taking the mug out of the bowl)
  ; ---------------------------------------------------------------
  (:action remove
    :parameters (?o - object ?c - object ?l - location)
    :precondition (and
                    (robot-at ?l)
                    (gripper-empty)
                    (in ?o ?c)
                    (at ?c ?l))
    :effect (and
              (holding ?o)
              (not (gripper-empty))
              (not (in ?o ?c)))
  )

  ; ---------------------------------------------------------------
  ; Grasp an object that is resting freely at a location
  ; ---------------------------------------------------------------
  (:action grasp
    :parameters (?o - object ?l - location)
    :precondition (and
                    (robot-at ?l)
                    (gripper-empty)
                    (at ?o ?l))
    :effect (and
              (holding ?o)
              (not (gripper-empty))
              (not (at ?o ?l)))
  )

  ; ---------------------------------------------------------------
  ; Position a held object at the robot's current location
  ; (gripper still closed around it)
  ; ---------------------------------------------------------------
  (:action place
    :parameters (?o - object ?l - location)
    :precondition (and
                    (holding ?o)
                    (robot-at ?l))
    :effect (and
              (at ?o ?l)
              (positioned ?o))
  )

  ; ---------------------------------------------------------------
  ; Open the gripper and let go of an already-positioned object
  ; ---------------------------------------------------------------
  (:action release
    :parameters (?o - object)
    :precondition (and
                    (holding ?o)
                    (positioned ?o))
    :effect (and
              (not (holding ?o))
              (gripper-empty)
              (not (positioned ?o)))
  )

)

; problem
(define (problem serve-mug-and-bowl)
  (:domain robotic-object-serving)

  (:objects
    mug bowl - object
    table-loc mug-serving-loc bowl-serving-loc - location
  )

  (:init
    (robot-at table-loc)
    (gripper-empty)
    (at bowl table-loc)
    (in mug bowl)
  )

  (:goal
    (and
      (at mug mug-serving-loc)
      (at bowl bowl-serving-loc)
      (gripper-empty)
    )
  )
)

; plan
1. (remove mug bowl table-loc)
   deleted: (gripper-empty) (in mug bowl)
   added: (holding mug)
   goals met: 0 of 3
2. (move table-loc mug-serving-loc)
   deleted: (robot-at table-loc)
   added: (robot-at mug-serving-loc)
   goals met: 0 of 3
3. (place mug mug-serving-loc)
   added: (at mug mug-serving-loc) (positioned mug)
   goals met: 1 of 3
4. (release mug)
   deleted: (holding mug) (positioned mug)
   added: (gripper-empty)
   goals met: 2 of 3
5. (move mug-serving-loc table-loc)
   deleted: (robot-at mug-serving-loc)
   added: (robot-at table-loc)
   goals met: 2 of 3
6. (grasp bowl table-loc)
   deleted: (gripper-empty) (at bowl table-loc)
   added: (holding bowl)
   goals met: 1 of 3
7. (move table-loc bowl-serving-loc)
   deleted: (robot-at table-loc)
   added: (robot-at bowl-serving-loc)
   goals met: 1 of 3
8. (place bowl bowl-serving-loc)
   added: (at bowl bowl-serving-loc) (positioned bowl)
   goals met: 2 of 3
9. (release bowl)
   deleted: (holding bowl) (positioned bowl)
   added: (gripper-empty)
   goals met: 3 of 3
